trade_exp/src/DataProcessors/РабочееМестоКладовщикаАльтерра/РабочееМестоКладовщикаАльтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоКладовщикаАльтерра</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОтгрузки</name>
      <type>
        <types>DefinedType.РаспоряжениеНаОтгрузку</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковочныйЛист</name>
      <type>
        <types>DocumentRef.УпаковочныйЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковочныйЛистРодитель</name>
      <type>
        <types>DocumentRef.УпаковочныйЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоУпаковочныйЛист</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Ссылка</name>
      <type>
        <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DefinedType.РаспоряжениеНаПоступление</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/РазмещениеНоменклатурыПоСкладскимЯчейкам/РазмещениеНоменклатурыПоСкладскимЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РазмещениеНоменклатурыПоСкладскимЯчейкам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ОсновнаяЯчейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7150e659-c510-45e5-9deb-fddf7441e996">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ЖурналРаботыТСД/ЖурналРаботыТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="904204ca-b505-40d9-ab77-91efafb3e72c">
  <name>ЖурналРаботыТСД</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="198e6b45-296a-43ad-b31b-58e5a7472d98">
    <name>Событие</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="e0085dec-4f43-41d1-acb4-e9618ec044c1">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="4a87aa31-1f35-41a1-852a-55983e82c4a0">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0ed7e719-6d91-49d0-96f6-4361d7ee0461">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c9cd36ae-3b67-4ce7-acb8-a5604211090f">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4fe9aacb-81af-4847-9815-8e8ecc83ac88">
    <name>ИдентификаторКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="555f1c4f-02e2-493e-bd5a-5e1596a1014e">
    <name>НомерСеанса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ЭлектроннаяОчередьКлиентов/ЭлектроннаяОчередьКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d8c9c294-870a-44ea-8c5a-f42a13a7459f">
  <name>ЭлектроннаяОчередьКлиентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="7bf41d18-a27a-4fba-80a3-8f6785279797">
    <name>ЧастичноОтгружен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b0a91b44-0e01-4076-bc0a-e247692c423d">
    <name>Заехал</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e7944fb5-14d5-41da-8470-3a465f450b0b">
    <name>ОтметкаКассы</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="99ad658e-788e-4122-b16a-fcaa62283677">
    <name>ТребуетсяОповещениеКладовщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="0e22a688-0adf-48bf-b768-8d362798bfa0">
    <name>ПолучательУведомления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="801d9ec6-cb3c-4867-98c2-4afaa72c9673">
    <name>СтатусОрдера</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5dccbe81-f872-46d5-a8a5-30af95c1f5d6">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d26f016a-39dd-4378-824e-bb04999f6b10">
    <name>ССайта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5888bede-9c96-4076-b99f-977e4a559fc0">
    <name>НомерДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="f75ffc24-34ae-4ec8-92d2-90c5ccaaa229">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="16ef9874-783e-49a8-bbc6-59fbe7b17586">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f3371cf8-1d4f-43fc-a7ad-e3e827a6f002">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СтатусыЧековККМ/СтатусыЧековККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыЧековККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Пробит</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="994ecf6c-34a9-4274-952e-8a44959ddd3d">
    <name>КОплате</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="238e807a-b6d8-401c-b115-0e10b84a16c1">
    <name>ОтложенБезРезервирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b8d448b2-f4c4-4fef-bd83-69bf834a37d5">
    <name>ОтложенСРезервированием</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыРасходныхОрдеров/СтатусыРасходныхОрдеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d873fb7c-bffd-4ee5-9885-25af6032a41f">
  <name>СтатусыРасходныхОрдеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="5394523f-1d18-4bb7-94ac-c5f9ed62888e">
    <name>КОтбору</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2fcc0b73-2f07-413e-aa8c-c99b38f0655b">
    <name>Подготовлен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9a7f17cc-0bed-409a-bf22-547957e4b4a3">
    <name>КПроверке</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="92258e4f-ec60-44a5-9ef6-60af9d22d0f4">
    <name>ВПроцессеПроверки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="47a95af3-e94f-43dd-b105-b0009956fe02">
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bdc2dd3b-b02c-4815-af56-2538b334fbf4">
    <name>Отгружен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыПриходныхОрдеров/СтатусыПриходныхОрдеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="58ab352b-2fda-4618-8f5e-14d83c1300f2">
  <name>СтатусыПриходныхОрдеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="51091c69-7e1a-4e28-8412-c3a970faaf1d">
    <name>ВРаботе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="fcb9b0b5-3360-47e9-bb41-297eaf6890d9">
    <name>ТребуетсяОбработка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыПересчетовТоваров/СтатусыПересчетовТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыПересчетовТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="688e1ea4-1165-44c7-82ae-6d12f51b7aa5">
    <name>Подготовлено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2f76743d-d91e-4ad6-9315-9972509a3e14">
    <name>ВРаботе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="adbdecd7-7147-4c89-9207-2c1d3c562caa">
    <name>ВнесениеРезультатов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7a6d2cd1-f59e-4f36-aee8-0dfbe3127c2e">
    <name>Выполнено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="40b327e9-803e-48ef-8649-52ab96822485">
    <name>Отменено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e1638101-0ac4-4b15-93ff-5c57eb1ae9b9">
    <name>Приостановлено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыЭлектроннойОчереди/СтатусыЭлектроннойОчереди.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="50ebb253-dfc9-40d8-b492-fcbfb669bc01">
  <name>СтатусыЭлектроннойОчереди</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b235c12d-541e-4263-bf1d-e5521ad06455">
    <name>ОжидаетсяОтбор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="83736d22-9656-4e5f-97c8-dcdcdec7ef61">
    <name>Набирается</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c45f0107-54a2-4b21-ae97-e14dca629ad9">
    <name>Набран</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a5091316-357f-4d00-9ffb-5683c9bac672">
    <name>Выдан</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/DataProcessors/РабочееМестоКладовщикаАльтерра/Forms/ФормаСканированиеСотрудника/Module.bsl
&НаКлиенте
Перем УстановочныйФайл;


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
    Элементы.ДляТестовойБазы.Видимость = НЕ АльтерраОбщегоНазначения.ЭтоРабочаяБаза();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено,ЭтаФорма, "СканерШтрихкода");
	ИнициализироватьСканер();	
	ПодключитьОбработчикОжидания("ОбновитьДанныеПоКоличествуЗаданий", 60, Ложь);
	ПодключитьОбработчикОжидания("ПроверкаВерсииПриложения", 1, Истина); 
	
	Если ЗначениеЗАполнено(Сотрудник) ТОгда 
		//Подключение оповещений из очереди

					Секции = СекцииСотрудника();
					СообщениеОбработано = Истина;
					Если ЭлектроннаяОчередьНаСекции() Тогда //Если у секции нет флага ЭлектроннаяОчередь, то ее подключение на ТСД не нужно 
						Если Не ПолучитьСостояниеОповещений() Тогда
							ОповещенияИзОчереди = Истина;
						Иначе
							ОповещенияИзОчереди = ОповещенияПоСотруднику(); 
						КонецЕсли;
					Иначе 
						ОповещенияИзОчереди = Ложь; 	
					КонецЕсли; 
					Инт = 60;
					Для каждого Стр Из Секции Цикл
						ЗнчИнтервала = Стр.Значение.ИнтервалОповещений;
						Если ЗнчИнтервала <> 0 И Инт > ЗнчИнтервала Тогда
							Инт = ЗнчИнтервала;
						КонецЕсли; 
					КонецЦикла; 
					ИнтервалОповещений = Инт; 
					
					Если ОповещенияИзОчереди Тогда 
						Элементы.ГруппаСписокОчереди.Видимость = Истина; 
						ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь); 
						ПроверкаЭлектроннойОчереди(); 
					Иначе 
						Элементы.ГруппаСписокОчереди.Видимость = Ложь;	
					КонецЕсли;
				КонецЕсли;
				
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если  ИмяСобытия = "ScanData" ИЛИ ИмяСобытия = "Barcode" Тогда
			Если ТипЗнч(Параметр) = Тип("Массив") Тогда
				Штрихкод1 =  Параметр;
			иначе
				Штрихкод1 = Новый Массив;
				Штрихкод1.Добавить(Параметр);
				Штрихкод1.Добавить(Неопределено);
			конецесли;
			Данные= ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Штрихкод1);
			Штрихкод= Данные.Штрихкод;
			
			Если ПустаяСтрока(Штрихкод) Тогда
				Элементы.Декорация1.Заголовок = "Не удалось прочитать штрихкод! Считайте штрихкод еще раз!";
				Элементы.Декорация1.ЦветТекста= WebЦвета.Красный;
				Элементы.Декорация1.Видимость = Истина;
				Элементы.СчитатьШтрихкод.Видимость = Истина;
				ЭтаФорма.Элементы.ГруппаГлавноеМеню.Видимость = Ложь;
				Возврат;
			КонецЕсли;
			
			Если Лев(Штрихкод, 4) = "8888" Тогда//Это сотрудник
				Сотрудник = НайтиСотрудникаПоКоду(Штрихкод);
				Если Сотрудник.Пустая() Тогда
					Элементы.Декорация1.Заголовок = "Нет сотрудника с данным штрихкодом или у cотрудника в карточке не заполнена табличная часть 'Рабочие участки (ТСД)'!";
					Элементы.Декорация1.ЦветТекста= WebЦвета.Красный;
					Элементы.Декорация1.Видимость = Истина;
					Элементы.СчитатьШтрихкод.Видимость = Истина;
					ЭтаФорма.Элементы.ГруппаГлавноеМеню.Видимость = Ложь;
				Иначе
					СотрудникНайден(); 
					Возврат;
				КонецЕсли;
			Иначе
				Элементы.Декорация1.Заголовок = "Не удалось прочитать штрихкод! Считайте штрихкод еще раз!";
				Элементы.Декорация1.ЦветТекста= WebЦвета.Красный;
				Элементы.Декорация1.Видимость = Истина;
				Элементы.СчитатьШтрихкод.Видимость = Истина;
				ЭтаФорма.Элементы.ГруппаГлавноеМеню.Видимость = Ложь;
				Возврат;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура _Вход(Команда)
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		СотрудникНайден();
		Элементы.ДляТестовойБазы.Видимость = Ложь;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Введите сотрудника!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникНайден()
	ЭтаФорма.Заголовок = Строка(Сотрудник);
	ЭтаФорма.Элементы.ГруппаГлавноеМеню.Видимость = Истина;
	Элементы.Декорация1.Видимость = Ложь;
	ОбновитьДанныеПоКоличествуЗаданийНаСервере();

	УстановитьТекущегоСотрудника(Сотрудник);
	Альтерра_СкладСервер.ЗаписьВРегистрЖурналРаботыТСД(ПредопределенноеЗначение("Перечисление.СобытияРаботыТСД.Вход"));
			
	СсылкаНаПоследнийДокумент = ПолучитьПоследнийДокументНеВыполненный(Сотрудник);

	//Подключение оповещений из очереди

	Секции = СекцииСотрудника();
	СообщениеОбработано = Истина;
	Если ЭлектроннаяОчередьНаСекции() Тогда //Если у секции нет флага ЭлектроннаяОчередь, то ее подключение на ТСД не нужно 
		Если Не ПолучитьСостояниеОповещений() Тогда
			ОповещенияИзОчереди = Истина;
		Иначе
			ОповещенияИзОчереди = ОповещенияПоСотруднику(); 
		КонецЕсли;
	Иначе 
		ОповещенияИзОчереди = Ложь; 	
	КонецЕсли; 
	Инт = 60;
	Для каждого Стр Из Секции Цикл
		ЗнчИнтервала = Стр.Значение.ИнтервалОповещений;
		Если ЗнчИнтервала <> 0 И Инт > ЗнчИнтервала Тогда
			Инт = ЗнчИнтервала;
		КонецЕсли; 
	КонецЦикла; 
	ИнтервалОповещений = Инт; 
	 
	Если ОповещенияИзОчереди Тогда 
		Элементы.ГруппаСписокОчереди.Видимость = Истина; 
		ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь); 
		ПроверкаЭлектроннойОчереди(); 
	Иначе 
		Элементы.ГруппаСписокОчереди.Видимость = Ложь;	
	КонецЕсли;


	Если Не СсылкаНаПоследнийДокумент = Неопределено Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораВарианта",ЭтотОбъект,Новый Структура("Документ",СсылкаНаПоследнийДокумент));
		ПоказатьВопрос(Оповещение,"Открыть последний документ?",РежимДиалогаВопрос.ДаНет,0,КодВозвратаДиалога.Да);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
    Отказ = Истина;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
		ЭтотОбъект);
		
		ПоказатьВопрос(Оповещение,
		"Спасибо за работу! Завершить?",
		РежимДиалогаВопрос.ДаНет,
		0, // таймаут в секундах
		КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
		"Завершение работы"
		);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Дополнительно(Команда)
   	ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.Форма",Новый Структура("Сотрудник,ИмяКоманды,РольМобильногоКлиента",Сотрудник,"Дополнительно",РольМобильногоКлиента),ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Отгрузка(Команда)
	ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.Форма",Новый Структура("Сотрудник,ИмяКоманды,РольМобильногоКлиента",Сотрудник,"Отгрузка",РольМобильногоКлиента),ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Пересчет(Команда)
  	ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.Форма",Новый Структура("Сотрудник,ИмяКоманды,РольМобильногоКлиента",Сотрудник,"Пересчет",РольМобильногоКлиента),ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Приемка(Команда)
 	ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.Форма",Новый Структура("Сотрудник,ИмяКоманды,РольМобильногоКлиента",Сотрудник,"Приемка",РольМобильногоКлиента),ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЦенников(Команда)
  	ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.Форма",Новый Структура("Сотрудник,ИмяКоманды,РольМобильногоКлиента",Сотрудник,"ПроверкаЦенников",РольМобильногоКлиента),ЭтотОбъект);
КонецПроцедуры


&НаКлиенте
Процедура ПроверкаАдресногоХранения(Команда)
	ОткрытьФорму("Обработка.ПроверкаАдресногоХранения.Форма.ФормаТСД", Новый Структура("Сотрудник", Сотрудник), ЭтотОбъект);
КонецПроцедуры
 #КонецОбласти 

#Область СлужебныеПроцедурыИФункции   

#Область ПроверкаВерсииПриложения  

&НаКлиенте
Процедура ПроверкаВерсииПриложения()        
	
	Если АльтерраОбщегоНазначения.ЭтоРабочаяБаза() Тогда     
		
		СистемнаяИнформация = Новый СистемнаяИнформация;
		АктуальнаяВерсия = ПолучитьАктуальнуюВерсию();   
		
		Если ЗначениеЗаполнено(АктуальнаяВерсия) И АктуальнаяВерсия <> СистемнаяИнформация.ВерсияПриложения  Тогда    

			ПоказатьВопрос(Новый ОписаниеОповещения("ОбновитьВерсиюЗавершение", ЭтаФорма), 
			"Версия вашего приложения: "  + СистемнаяИнформация.ВерсияПриложения + Символы.ПС +
			"не совпадает с актуальной: "  + АктуальнаяВерсия + "." + Символы.ПС + 
			"Обновить?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли;     
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьАктуальнуюВерсию()   
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ВерсияМобильногоКлиента.Получить();
КонецФункции	 
	 
&НаКлиенте
Процедура ОбновитьВерсиюЗавершение(РезультатВопроса, Параметры) Экспорт 
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда   
		
		СкачиваемыйФайл = СохранитьФайлНаСервере();     
		
		Если СкачиваемыйФайл.ПолноеИмяФайла <> "" Тогда                   
			
			ВключитьОжидание(Истина);
			
			ПутьНаУстройстве = "/storage/emulated/0/Download/"; 
			ЛокальноеИмяФайла = ПутьНаУстройстве + СкачиваемыйФайл.ИмяФайла;           
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ПутьКФайлу", ПутьНаУстройстве);
			ДополнительныеПараметры.Вставить("ИмяФайла", СкачиваемыйФайл.ИмяФайла);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПолученияФайлаССервера", ЭтотОбъект, ДополнительныеПараметры);
			НачатьПолучениеФайлаССервера(ОписаниеОповещения, СкачиваемыйФайл.Адрес, ЛокальноеИмяФайла);     
			
			ПодключитьОбработчикОжидания("ЗапустьСкачанныйФайлУстановки", 1, Ложь);
		Иначе
			ПоказатьПредупреждение(, "Отсутствует файл обновления " + Символы.ПС + СкачиваемыйФайл.ПолноеИмяФайла, 0, "Обновление не найдено");	
		КонецЕсли;
	КонецЕсли;                                                      
КонецПроцедуры   

 &НаСервере
 Функция СохранитьФайлНаСервере()   
	УстановитьПривилегированныйРежим(Истина);    
	
	НахождениеОбновленияМобильногоКлиента = Константы.НахождениеОбновленияМобильногоКлиента.Получить();
	СкачиваемыйФайл = Новый Структура("ПолноеИмяФайла, ИмяФайла, Адрес", "", "", "");
	
	ФайлНаДиске = Новый Файл(НахождениеОбновленияМобильногоКлиента);
	Если ФайлНаДиске.Существует() Тогда                                        
		
		СкачиваемыйФайл.ПолноеИмяФайла = НахождениеОбновленияМобильногоКлиента;
		СкачиваемыйФайл.ИмяФайла = ПолучитьИмяФайла(НахождениеОбновленияМобильногоКлиента);

		Двоичное = Новый ДвоичныеДанные(НахождениеОбновленияМобильногоКлиента); 
		СкачиваемыйФайл.Адрес = ПоместитьВоВременноеХранилище(Двоичное, ЭтаФорма.УникальныйИдентификатор); 
	КонецЕсли;
	
	Возврат СкачиваемыйФайл; 
 КонецФункции

&НаКлиенте
Процедура ПослеПолученияФайлаССервера(ПолученныйФайл, ДополнительныеПараметры) Экспорт
	УстановочныйФайл = ДополнительныеПараметры;
КонецПроцедуры  
	
&НаКлиенте
Процедура ЗапустьСкачанныйФайлУстановки()

	Если ЗначениеЗаполнено(УстановочныйФайл) Тогда 
	  
		ОтключитьОбработчикОжидания("ЗапустьСкачанныйФайлУстановки"); 
		ВключитьОжидание(Ложь);       
		
		ФайлНаДиске = Новый Файл(УстановочныйФайл.ПутьКФайлу + УстановочныйФайл.ИмяФайла);
		Если ФайлНаДиске.Существует() Тогда    
			
			Если ТекущаяДата() - ФайлНаДиске.ПолучитьВремяИзменения() < 60*30 Тогда // файл получасовой свежести
				Заголовок = "Обновление скачано";
				ТекстСообщения = "Перейдите в папку загрузок " + УстановочныйФайл.ПутьКФайлу + Символы.ПС + "и запустите файл " + УстановочныйФайл.ИмяФайла;
			Иначе     
				Заголовок = "Обновление не скачано";
				ТекстСообщения = "В папке загрузок " + УстановочныйФайл.ПутьКФайлу + Символы.ПС + "старый файл " + УстановочныйФайл.ИмяФайла;
			КонецЕсли;
		Иначе
			Заголовок = "Обновление не скачано";
			ТекстСообщения = "В папке загрузок " + УстановочныйФайл.ПутьКФайлу + Символы.ПС + "нет файла " + УстановочныйФайл.ИмяФайла;
		КонецЕсли;                                                                                                            
		
		ПоказатьПредупреждение(, ТекстСообщения, 0, Заголовок);
	КонецЕсли;  
КонецПроцедуры  	

Функция ПолучитьИмяФайла(СтрокаПути)   
	
	ИмяФайла = СтрокаПути;
	
	Пока Не Найти(ИмяФайла, "\") = 0 Цикл
		ИмяФайла = Сред(ИмяФайла, Найти(ИмяФайла, "\") + 1);
	КонецЦикла;  
	
	Возврат ИмяФайла;
КонецФункции

&НаКлиенте
Процедура ВключитьОжидание(НадоПодождать)
	Элементы.ГруппаОжидание.Видимость = НадоПодождать;
	Элементы.Декорация1.Видимость = Не НадоПодождать;
	Элементы.СчитатьШтрихкод.Видимость = Не НадоПодождать;
КонецПроцедуры
 
#КонецОбласти


&НаКлиенте
Процедура ИнициализироватьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		Попытка
		глВКRSDriver.УстановитьПараметр("Barcode_BEEP",Истина);
		глВКRSDriver.УстановитьПараметр("Barcode_BZZ",Истина);
		глВКRSDriver.Подключить("Barcode");	
		Исключение
		КонецПопытки;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСканер()
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		
		Попытка
			глВКRSDriver.Отключить("Barcode");	
		Исключение
		КонецПопытки;
		
	#КонецЕсли
	
КонецПроцедуры

Функция НайтиСотрудникаПоКоду(Штрихкод)
	
	СотрудникПустаяССылка = Справочники.сотрудники.ПустаяСсылка();
	
	НайденныйСотрудник= Справочники.Сотрудники.НайтиПоКоду(Штрихкод);
	
	Если ЗначениеЗаполнено(НайденныйСотрудник) Тогда
		Если НайденныйСотрудник.РабочиеУчастки.Количество()>0 Тогда
			РольМобильногоКлиента = НайденныйСотрудник.РольМобильногоКлиента;
			Возврат НайденныйСотрудник;
		Иначе
			Возврат СотрудникПустаяССылка;
		КонецЕсли;
	Иначе
		Возврат СотрудникПустаяССылка;
	КонецЕсли;

КонецФункции

Процедура УстановитьТекущегоСотрудника(Сотрудник)
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыСеанса.ТекущийСотрудник = Сотрудник;
	
	УстановитьПривилегированныйРежим(Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Альтерра_СкладСервер.ЗаписьВРегистрЖурналРаботыТСД(ПредопределенноеЗначение("Перечисление.СобытияРаботыТСД.Выход"));
		ОтключитьСканер();
		ЗавершитьРаботуСистемы(Ложь);
	КонецЕсли;	
 
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВарианта(Результат, ДополнительныеПараметры) Экспорт
	Документ = "";
	Если Результат = КодВозвратаДиалога.Да Тогда
		ДокСсылка = ДополнительныеПараметры.Документ;
		Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
			Документ = "Документ.РасходныйОрдерНаТовары.Форма.Док_ФормаДокументаДляТСД";
		ИначеЕсли 
			ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
			Документ = "Документ.ПриходныйОрдерНаТовары.Форма.Док_ФормаДокументаТСД";
		Иначе
		  	Документ = "Документ.ПересчетТоваров.Форма.Док_ФормаДокументаТСД"; 
		КонецЕсли;
		Если Не Документ = "" Тогда 
			ОткрытьФорму(Документ,Новый Структура("Ключ,Секции,ТекущийСотрудникТСД",ДокСсылка,СекцииСотрудника(),Сотрудник));
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПоКоличествуЗаданий() Экспорт
	ДанныеПоКоличеству = ОбновитьДанныеПоКоличествуЗаданийНаСервере();
	КоличествоДокПриемка = ДанныеПоКоличеству.КоличествоДокПриемка;
	Если КоличествоДокОтгрузка < ДанныеПоКоличеству.КоличествоДокОтгрузка Тогда
	КоличествоДокОтгрузка = ДанныеПоКоличеству.КоличествоДокОтгрузка;
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
	Если СредстваМультимедиа.ПоддерживаетсяВоспроизведениеТекста() Тогда
						СредстваМультимедиа.ВоспроизвестиТекст("Новое задание!","ru-RU");
					Иначе
						СредстваМультимедиа.ВоспроизвестиЗвуковоеОповещение();
					КонецЕсли;
					#КонецЕсли
	КонецЕсли;
	КоличествоДокПересчет = ДанныеПоКоличеству.КоличествоДокПересчет;
КонецПроцедуры

Функция ОбновитьДанныеПоКоличествуЗаданийНаСервере()
	ДанныеПоКоличеству = ОбновитьДанныеНаСервере(Сотрудник.РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток"),Сотрудник.Склад);
	Возврат ДанныеПоКоличеству;
КонецФункции

Функция ОбновитьДанныеНаСервере(Секция,Склад)
		
	СтруктураДанныхВозврата = Новый Структура;
	СтруктураДанныхВозврата.Вставить("КоличествоДокПриемка",);
	СтруктураДанныхВозврата.Вставить("КоличествоДокОтгрузка",);
	СтруктураДанныхВозврата.Вставить("КоличествоДокПересчет",);
		
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыКПоступлениюОстатки.ДокументПоступления) КАК КоличествоДокПриемка,
	               |	0 КАК КоличествоДокОтгрузка,
	               |	0 КАК КоличествоДокПересчет
	               |ПОМЕСТИТЬ ВТ_Временная
	               |ИЗ
	               |	РегистрНакопления.ТоварыКПоступлению.Остатки(&КонецДня, Склад = &Склад) КАК ТоварыКПоступлениюОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	               |		ПО ТоварыКПоступлениюОстатки.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	               |			И ТоварыКПоступлениюОстатки.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	               |			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	               |ГДЕ
	               |	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток > 0
	               |	И ВЫБОР
	               |			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
	               |				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток В (&Секция)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	               |			КОГДА ТоварыКОтгрузке.ДокументОтгрузки ССЫЛКА Документ.ЗаказНаПеремещение
	               |				ТОГДА ПеремещениеТоваров.Ссылка
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ТоварыКОтгрузке.ДокументОтгрузки ССЫЛКА Документ.ЗаказКлиента
	               |						ТОГДА РеализацияТоваровУслуг.Ссылка
	               |					ИНАЧЕ ТоварыКОтгрузке.ДокументОтгрузки
	               |				КОНЕЦ
	               |		КОНЕЦ),
	               |	0
	               |ИЗ
	               |	РегистрНакопления.ТоварыКОтгрузке.Остатки(&КонецДня, Склад = &Склад) КАК ТоварыКОтгрузке
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	               |		ПО ТоварыКОтгрузке.ДокументОтгрузки = ПеремещениеТоваров.ЗаказНаПеремещение
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ТоварыКОтгрузке.ДокументОтгрузки = РеализацияТоваровУслуг.ЗаказКлиента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	               |		ПО ТоварыКОтгрузке.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	               |			И ТоварыКОтгрузке.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	               |			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
	               |				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток В (&Секция)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ТоварыКОтгрузке.КОтгрузкеОстаток > 0
	               |	И ТоварыКОтгрузке.ДокументОтгрузки.Дата >= &ДатаНачалаОрдерной
	               |	И ВЫБОР
	               |			КОГДА ТоварыКОтгрузке.ДокументОтгрузки ССЫЛКА Документ.ЗаказКлиента
	               |				ТОГДА НЕ РеализацияТоваровУслуг.Ссылка.Кассир = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ТоварыКОтгрузке.ДокументОтгрузки ССЫЛКА Документ.РеализацияТоваровУслуг
	               |						ТОГДА НЕ ТоварыКОтгрузке.ДокументОтгрузки.Кассир = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ТоварыКОтгрузке.ДокументОтгрузки ССЫЛКА Документ.ЧекККМ
	               |								ТОГДА ТоварыКОтгрузке.ДокументОтгрузки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	               |							ИНАЧЕ ИСТИНА
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	0,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПересчетТоваров.Ссылка)
	               |ИЗ
	               |	Документ.ПересчетТоваров КАК ПересчетТоваров
	               |ГДЕ
	               |	ПересчетТоваров.Склад = &Склад
	               |	//И ПересчетТоваров.Проведен = ИСТИНА
	               |	И ПересчетТоваров.Дата МЕЖДУ &НачалоДня И &КонецДня
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВТ_Временная.КоличествоДокПриемка) КАК КоличествоДокПриемка,
	               |	СУММА(ВТ_Временная.КоличествоДокПересчет) КАК КоличествоДокПересчет,
	               |	СУММА(ВТ_Временная.КоличествоДокОтгрузка) КАК КоличествоДокОтгрузка
	               |ИЗ
	               |	ВТ_Временная КАК ВТ_Временная";
	
	Запрос.УстановитьПараметр("Секция", Секция);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ДатаНачалаОрдерной", Склад.ДатаНачалаОрдернойСхемыПриОтгрузке);
	
	Запрос.УстановитьПараметр("НачалоДня", Началодня(ТекущаяДата()));	
    Запрос.УстановитьПараметр("КонецДня", КонецДня(ТекущаяДата()));	

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 ЗаполнитьЗначенияСвойств(СтруктураДанныхВозврата,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
		
	Возврат СтруктураДанныхВозврата;
КонецФункции

&НаКлиенте
Процедура СчитатьШтрихкод(Команда)
	#Если МобильныйКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			ОповещениеСканирования = Новый ОписаниеОповещения("ОбработкаОтсканированногоШтрихкода",ЭтотОбъект);
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Scan code",ОповещениеСканирования,,ТипШтрихкода.Все);
		Иначе
			Сообщить("Сканирование не поддерживается!");
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтсканированногоШтрихкода(Штрихкод,Результат,Сообщение,ДопПараметры) Экспорт
	
	Если Результат и ЗначениеЗаполнено(Штрихкод) Тогда
	
		#Если МобильныйКлиент Тогда
		    СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		
		    Если ПустаяСтрока(Штрихкод) Тогда
				Элементы.Декорация1.Заголовок = "Не удалось прочитать штрихкод! Считайте штрихкод еще раз!";
				Элементы.Декорация1.ЦветТекста= WebЦвета.Красный;
				Элементы.Декорация1.Видимость = Истина;
				ЭтаФорма.Элементы.ГруппаГлавноеМеню.Видимость = Ложь;
				Возврат;
			КонецЕсли;
			
			Если Лев(Штрихкод, 4) = "8888" Тогда//Это сотрудник
				Сотрудник = НайтиСотрудникаПоКоду(Штрихкод);
				Если Сотрудник.Пустая() Тогда
					Элементы.Декорация1.Заголовок = "Нет сотрудника с данным штрихкодом или у cотрудника в карточке не заполнена табличная часть 'Рабочие участки (ТСД)'!";
					Элементы.Декорация1.ЦветТекста= WebЦвета.Красный;
					Элементы.Декорация1.Видимость = Истина;
					ЭтаФорма.Элементы.ГруппаГлавноеМеню.Видимость = Ложь;
				Иначе
					
					УстановитьВидимостьКоманд();					
					
					ЭтаФорма.Заголовок = Строка(Сотрудник);
					ЭтаФорма.Элементы.ГруппаГлавноеМеню.Видимость = Истина;
					Элементы.Декорация1.Видимость = Ложь;
					Элементы.СчитатьШтрихкод.Видимость = Ложь;
                   
					ОбновитьДанныеПоКоличествуЗаданийНаСервере();
					
					УстановитьТекущегоСотрудника(Сотрудник);
					Альтерра_СкладСервер.ЗаписьВРегистрЖурналРаботыТСД(ПредопределенноеЗначение("Перечисление.СобытияРаботыТСД.Вход"));
							
					СсылкаНаПоследнийДокумент = ПолучитьПоследнийДокументНеВыполненный(Сотрудник);
					
					//Подключение оповещений из очереди

					Секции = СекцииСотрудника();
					СообщениеОбработано = Истина;
					Если ЭлектроннаяОчередьНаСекции() Тогда //Если у секции нет флага ЭлектроннаяОчередь, то ее подключение на ТСД не нужно 
						Если Не ПолучитьСостояниеОповещений() Тогда
							ОповещенияИзОчереди = Истина;
						Иначе
							ОповещенияИзОчереди = ОповещенияПоСотруднику(); 
						КонецЕсли;
					Иначе 
						ОповещенияИзОчереди = Ложь; 	
					КонецЕсли; 
					Инт = 60;
					Для каждого Стр Из Секции Цикл
						ЗнчИнтервала = Стр.Значение.ИнтервалОповещений;
						Если ЗнчИнтервала <> 0 И Инт > ЗнчИнтервала Тогда
							Инт = ЗнчИнтервала;
						КонецЕсли; 
					КонецЦикла; 
					ИнтервалОповещений = Инт; 
					
					Если ОповещенияИзОчереди Тогда 
						Элементы.ГруппаСписокОчереди.Видимость = Истина; 
						ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь); 
						ПроверкаЭлектроннойОчереди(); 
					Иначе 
						Элементы.ГруппаСписокОчереди.Видимость = Ложь;	
					КонецЕсли;

					
					Если Не СсылкаНаПоследнийДокумент = Неопределено Тогда
						Оповещение = Новый ОписаниеОповещения("ПослеВыбораВарианта",ЭтотОбъект,Новый Структура("Документ",СсылкаНаПоследнийДокумент));
						ПоказатьВопрос(Оповещение,"Открыть последний документ?",РежимДиалогаВопрос.ДаНет,0,КодВозвратаДиалога.Да);
					КонецЕсли;

					Возврат;

				КонецЕсли;
			Иначе
				Элементы.Декорация1.Заголовок = "Не удалось прочитать штрихкод! Считайте штрихкод еще раз!";
				Элементы.Декорация1.ЦветТекста= WebЦвета.Красный;
				Элементы.Декорация1.Видимость = Истина;
				ЭтаФорма.Элементы.ГруппаГлавноеМеню.Видимость = Ложь;
				Возврат;
			КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКоманд();
	Если РольМобильногоКлиента = ПредопределенноеЗначение("Перечисление.РолиМобильногоКлиента.Бухгалтер") Тогда
		ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.Форма",Новый Структура("Сотрудник,ИмяКоманды,РольМобильногоКлиента",Сотрудник,"Пересчет",РольМобильногоКлиента),ЭтотОбъект);	
	ИначеЕсли РольМобильногоКлиента = ПредопределенноеЗначение("Перечисление.РолиМобильногоКлиента.Кладовщик") Тогда
		Элементы.ГруппаКомандаПроверкаЦенников.Видимость = Ложь;	
	ИначеЕсли РольМобильногоКлиента = ПредопределенноеЗначение("Перечисление.РолиМобильногоКлиента.Менеджер") Тогда
		Элементы.ГруппаКомандаПриемки.Видимость = Ложь;
		Элементы.ГруппаКомандаОтгрузки.Видимость = Ложь;
		Элементы.Дополнительно.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьПоследнийДокументНеВыполненный(Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЖурналРаботыТСДСрезПоследних.Документ КАК Документ
	|ИЗ
	|	РегистрСведений.ЖурналРаботыТСД.СрезПоследних(
	|			,
	|			Событие = ЗНАЧЕНИЕ(Перечисление.СобытияРаботыТСД.Документ)
	|				И ВЫБОР 
	|				КОГДА ТИПЗНАЧЕНИЯ(Документ) = ТИП(Документ.РасходныйОрдерНаТовары) ТОГДА Документ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтбору)
	|				КОГДА ТИПЗНАЧЕНИЯ(Документ) = ТИП(Документ.ПриходныйОрдерНаТовары) ТОГДА Документ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.ВРаботе)
	|			    КОГДА ТИПЗНАЧЕНИЯ(Документ) = ТИП(Документ.ПересчетТоваров) ТОГДА Документ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПересчетовТоваров.ВРаботе)
	|			КОНЕЦ	
	|				И Документ.Проведен
	|				И Сотрудник = &Сотрудник) КАК ЖурналРаботыТСДСрезПоследних
	|";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Документ;
	
КонецФункции

Функция СекцииСотрудника()
	Возврат Сотрудник.РабочиеУчастки.ВыгрузитьКолонку("РабочийУчасток");
КонецФункции





#КонецОбласти     

#Область Оповещения 
&НаКлиенте
Процедура Оповещения(Команда)
	Если ОповещенияИзОчереди Тогда
		ПричинаОтказа = "";
		ОповещенияПоСекцииПодключены = ПолучитьСостояниеОповещений();
				
		Если ПричинаОтказа = "" Тогда
			ОповещенияИзОчереди = Ложь;
			Сообщить("Оповещения отключены");
			Элементы.ГруппаСписокОчереди.Видимость = Ложь;
			ОтключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди");  
		Иначе
			Сообщить(ПричинаОтказа);
		КонецЕсли;
	Иначе
		ОповещенияИзОчереди = Истина;
		Сообщить("Оповещения подключены");
		Элементы.ГруппаСписокОчереди.Видимость = Истина; 
		ПодключитьОбработчикОжидания("ПроверкаЭлектроннойОчереди", 10, Ложь);  
		ПроверкаЭлектроннойОчереди(); 
	КонецЕсли;
	ЗаписатьЗначениеОповещения();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСписокОчереди(Команда)
	Если КлиентовВОчереди > 0 Тогда   
		ОткрытьФорму("Обработка.РабочееМестоКладовщикаАльтерра.Форма.Форма", Новый Структура("Сотрудник,ИмяКоманды,РольМобильногоКлиента,ОткрытьОчередь",Сотрудник,"Отгрузка",РольМобильногоКлиента,Истина),ЭтотОбъект);  
	Иначе
		Сообщить("Список очереди пуст");
	КонецЕСли;	
КонецПроцедуры  

&НаСервере
Функция ЭлектроннаяОчередьНаСекции()
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ
				 |	РабочиеУчастки.Ссылка КАК Ссылка,
				 |	РабочиеУчастки.ЭлектроннаяОчередь КАК ЭлектроннаяОчередь
				 |ИЗ
				 |	Справочник.РабочиеУчастки КАК РабочиеУчастки
				 |ГДЕ
				 |	РабочиеУчастки.Ссылка В(&Секции)
				 |	И РабочиеУчастки.ЭлектроннаяОчередь = Истина" ;
	Запрос.УстановитьПараметр("Секции", СекцииСотрудника()); 
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда 
		Возврат Истина; 
	Иначе 
		Возврат Ложь; 
	КонецЕсли;
	
КонецФункции 

&НаСервере
Функция ПолучитьСостояниеОповещений()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиРабочиеУчастки.Ссылка.ОповещенияИзОчереди КАК ОповещенияИзОчереди
		|ИЗ
		|	Справочник.Сотрудники.РабочиеУчастки КАК СотрудникиРабочиеУчастки
		|ГДЕ
		|	СотрудникиРабочиеУчастки.РабочийУчасток В(&РабочийУчасток)
		|	И СотрудникиРабочиеУчастки.Ссылка <> &Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	СотрудникиРабочиеУчастки.Ссылка.ОповещенияИзОчереди";
	
	Запрос.УстановитьПараметр("РабочийУчасток", СекцииСотрудника());
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 1 И Результат.Найти(Истина, "ОповещенияИзОчереди") = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции 


&НаКлиенте
Процедура ПроверкаЭлектроннойОчереди() Экспорт
	ОбновитьСписокОчереди();  
КонецПроцедуры   

&НаСервере
Процедура ОбновитьСписокОчереди() 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭлектроннаяОчередьКлиентов.Документ КАК Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления КАК Получатель
	|ИЗ
	|	РегистрСведений.ЭлектроннаяОчередьКлиентов КАК ЭлектроннаяОчередьКлиентов 
	|ГДЕ
	|   ЭлектроннаяОчередьКлиентов.ТребуетсяОповещениеКладовщику = Истина 
	|	И ЭлектроннаяОчередьКлиентов.ПолучательУведомления В (&Секции)   
	|	И не ЭлектроннаяОчередьКлиентов.Состояние = &Статус
	|
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭлектроннаяОчередьКлиентов.Документ,
	|	ЭлектроннаяОчередьКлиентов.ПолучательУведомления";
	
	
	Запрос.УстановитьПараметр("Секции", СекцииСотрудника());
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЭлектроннойОчереди.Выдан);
    РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		КлиентовВОчереди = РезультатЗапроса.Выбрать().Количество(); 
	Иначе
       КлиентовВОчереди = 0;
   	КонецЕсли;  
КонецПроцедуры 	

&НаСервере
Процедура ЗаписатьЗначениеОповещения() 
	УстановитьПривилегированныйРежим(Истина);
	ОбъектСотрудник = Сотрудник.ПолучитьОбъект();
	ОбъектСотрудник.ОповещенияИзОчереди = ОповещенияИзОчереди;
	ОбъектСотрудник.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаСервере
Функция ОповещенияПоСотруднику() 
	Возврат Сотрудник.ОповещенияИзОчереди; 
КонецФункции

&НаКлиенте
Процедура ПодключаемоеОборудование(Команда)
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.ФормаСписка",Новый Структура("ИмяКоманды","Дополнительно"),ЭтотОбъект);
КонецПроцедуры

#КонецОбласти
